---
layout: post
title: "Cisco Packet Tracer 学习笔记(四) 什么都防不了的防火墙"
date: 2018-11-29 15:30:00 +0800
categories: technology
tags: cisco
img: "https://i.loli.net/2018/11/29/5bffe08a6fb1f.png"
---

乱搞防火墙

## 防火墙

> 博文中用的环境是7.0版的Cisco Packet Tracer,实测下来6.2与7.2都会有那么一点点小小的出入

咱们先给电脑分配好ip,然后在防火墙上搞事情

防火墙是有密码的,所以en以后会提示你输入密码,因为默认密码为空,所以回车就行

enable以后咱们先别config terminal

我们先show一下防火墙的配置文件

```ciscoasa#sh run``` 显示配置文件
然后空格翻页,最后有几行
```
dhcpd auto_config outside
dhcpd address 192.168.1.5-192.168.1.36 inside
dhcpd enable inside
```
这样的东西,我们要把它们先删掉,方法非常简单

```ciscoasa#conf t``` 先进入配置模式

```
ciscoasa(config)#no dhcpd auto_config outside
ciscoasa(config)#no dhcpd address 192.168.1.5-192.168.1.36 inside
ciscoasa(config)#no dhcpd enable inside
```
输入上面那三条东西就可以删掉dhcp配置了

我们先将这两个接口分别划分至两个vlan
```
ciscoasa(config)#int e0/0
ciscoasa(config-if)#sw ac vlan 1
ciscoasa(config-if)#int e0/1
ciscoasa(config-if)#sw ac vlan 2
```
然后配置vlan 1的 ip 墙内外 安全等级
```
ciscoasa(config-if)#int vlan 1
ciscoasa(config-if)#no sh
ciscoasa(config-if)#ip add 192.168.1.254 255.255.255.0
ciscoasa(config-if)#nameif inside
ciscoasa(config-if)#security-level 100
```
然后配置vlan 2的 ip 墙内外 安全等级
```
ciscoasa(config-if)#int vlan 2
ciscoasa(config-if)#no sh
ciscoasa(config-if)#ip add 192.168.2.254 255.255.255.0
ciscoasa(config-if)#nameif outside
ciscoasa(config-if)#security-level 0
```
最后配置防火墙的安全策略
```
ciscoasa(config-if)#access-list 100 permit ip any any
ciscoasa(config-if)#access-group 100 in interface outside
```
虽然我不知道放行一切为什么还要防火墙(

然后左右的机器就可以ping通了

![firewall](https://i.loli.net/2018/11/18/5bf1252a1701d.jpg)

<div style="text-align: right"> 顺颂学安 </div>